SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                            #    ##
#  #   #   #    #  #                     #    ###
#  #####   #   ###    ###  #  #     # # ####   ##
#  #   #   #    #  #  #  # #  #      #  #   #  ##
#  #   #   #    #  #  #  #  ###     # #  ###  ####
#_____________________________#_________________________________________________
                           ###

attinyx61.build.board=AVR_ATTINYX61
attinyx61.build.core=tiny
attinyx61.build.variant=tinyx61
attinyx61.build.export_merged_output=false
attinyx61.bootloader.extended_fuses=0xFE
attinyx61.bootloader.high_fuses=0b{bootloader.rstbit}101{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx61.bootloader.rstbit=1
attinyx61.build.usbpinset=
attinyx61.build.tuneorcal=
attinyx61.build.softserabr=
attinyx61.build.softser=
attinyx61.build.wiremodeabr=
attinyx61.build.wiremode=
attinyx61.upload.tool=avrdude
attinyx61.bootloader.tool=avrdude
attinyx61.build.bootloader=
attinyx61.build.bootloaderabr=
attinyx61.bootloader.flashstring=

#########################
# Optimization menu     #
#########################
attinyx61.menu.optimization.size=-Os (size, recommended)
attinyx61.menu.optimization.othree=-O3 (speed)
attinyx61.menu.optimization.debug=-Og (for advanced debugging)
attinyx61.menu.optimization.size.build.optimize=-Os
attinyx61.menu.optimization.othree.build.optimize=-O3
attinyx61.menu.optimization.debug.build.optimize=-Og

#########################
# Microcontroller menu  #
#########################
attinyx61.menu.chip.861=ATtiny861
attinyx61.menu.chip.861.build.mcu=attiny861
attinyx61.menu.chip.861.upload.maximum_size=8192
attinyx61.menu.chip.861.upload.maximum_data_size=512
attinyx61.menu.chip.461=ATtiny461
attinyx61.menu.chip.461.build.mcu=attiny461
attinyx61.menu.chip.461.upload.maximum_size=4096
attinyx61.menu.chip.461.upload.maximum_data_size=256
attinyx61.menu.chip.261=ATtiny261
attinyx61.menu.chip.261.build.mcu=attiny261
attinyx61.menu.chip.261.upload.maximum_size=2048
attinyx61.menu.chip.261.upload.maximum_data_size=128

#########################
# Clocking menu options #
#########################
attinyx61.menu.clock.internal_8m=8 MHz (internal)
attinyx61.menu.clock.internal_8m.bootloader.low_fuses=0xE2
attinyx61.menu.clock.internal_8m.build.f_cpu=8000000L
attinyx61.menu.clock.internal_8m.build.speed=8m
attinyx61.menu.clock.internal_8m.build.clocksource=0
attinyx61.menu.clock.internal_1m=1 MHz (internal)
attinyx61.menu.clock.internal_1m.bootloader.low_fuses=0x62
attinyx61.menu.clock.internal_1m.build.f_cpu=1000000L
attinyx61.menu.clock.internal_1m.build.speed=1m
attinyx61.menu.clock.internal_1m.build.clocksource=0x10
attinyx61.menu.clock.internal_4m=4 MHz (internal)
attinyx61.menu.clock.internal_4m.bootloader.low_fuses=0x62
attinyx61.menu.clock.internal_4m.build.f_cpu=4000000L
attinyx61.menu.clock.internal_4m.build.speed=4m
attinyx61.menu.clock.internal_4m.build.clocksource=0x10
attinyx61.menu.clock.internal.4m.bootloader.f_cpu=1000000L
attinyx61.menu.clock.internal_2m=2 MHz (internal)
attinyx61.menu.clock.internal_2m.bootloader.low_fuses=0x62
attinyx61.menu.clock.internal_2m.build.f_cpu=2000000L
attinyx61.menu.clock.internal_2m.build.speed=2m
attinyx61.menu.clock.internal_2m.build.clocksource=0x10
attinyx61.menu.clock.internal.2m.bootloader.f_cpu=1000000L
attinyx61.menu.clock.pll_16m=16 MHz (PLL)
attinyx61.menu.clock.pll_16m.bootloader.low_fuses=0xF1
attinyx61.menu.clock.pll_16m.build.f_cpu=16000000L
attinyx61.menu.clock.pll_16m.build.speed=16m
attinyx61.menu.clock.pll_16m.build.clocksource=6
attinyx61.menu.clock.pll_16m5=16.5 MHz (PLL, tweaked)
attinyx61.menu.clock.pll_16m5.bootloader.low_fuses=0xF1
attinyx61.menu.clock.pll_16m5.build.f_cpu=16500000L
attinyx61.menu.clock.pll_16m5.build.speed=16m5
attinyx61.menu.clock.pll_16m5.build.clocksource=6
attinyx61.menu.clock.crystal_16m=16 MHz (crystal)
attinyx61.menu.clock.crystal_16m.bootloader.low_fuses=0xFF
attinyx61.menu.clock.crystal_16m.build.f_cpu=16000000UL
attinyx61.menu.clock.crystal_16m.build.speed=16
attinyx61.menu.clock.crystal_16m.build.clocksource=1
attinyx61.menu.clock.crystal_8m=8 MHz (crystal)
attinyx61.menu.clock.crystal_8m.bootloader.low_fuses=0xFF
attinyx61.menu.clock.crystal_8m.build.f_cpu=8000000UL
attinyx61.menu.clock.crystal_8m.build.speed=8
attinyx61.menu.clock.crystal_8m.build.clocksource=1
attinyx61.menu.clock.crystal_20m=20 MHz (crystal)
attinyx61.menu.clock.crystal_20m.bootloader.low_fuses=0xFF
attinyx61.menu.clock.crystal_20m.build.f_cpu=20000000UL
attinyx61.menu.clock.crystal_20m.build.speed=20
attinyx61.menu.clock.crystal_20m.build.clocksource=1
attinyx61.menu.clock.crystal_12m=12 MHz (crystal)
attinyx61.menu.clock.crystal_12m.bootloader.low_fuses=0xFF
attinyx61.menu.clock.crystal_12m.build.f_cpu=12000000UL
attinyx61.menu.clock.crystal_12m.build.speed=12
attinyx61.menu.clock.crystal_12m.build.clocksource=1
attinyx61.menu.clock.crystal_6m=6 MHz (crystal)
attinyx61.menu.clock.crystal_6m.bootloader.low_fuses=0xFD
attinyx61.menu.clock.crystal_6m.build.f_cpu=6000000UL
attinyx61.menu.clock.crystal_6m.build.speed=6
attinyx61.menu.clock.crystal_6m.build.clocksource=1
attinyx61.menu.clock.crystal_18432k=18.432 MHz (crystal)
attinyx61.menu.clock.crystal_18432k.bootloader.low_fuses=0xFF
attinyx61.menu.clock.crystal_18432k.build.f_cpu=18432000UL
attinyx61.menu.clock.crystal_18432k.build.speed=18432k
attinyx61.menu.clock.crystal_18432k.build.clocksource=1
attinyx61.menu.clock.crystal_14746k=14.746 MHz (crystal)
attinyx61.menu.clock.crystal_14746k.bootloader.low_fuses=0xFF
attinyx61.menu.clock.crystal_14746k.build.f_cpu=14746000UL
attinyx61.menu.clock.crystal_14746k.build.speed=14746k
attinyx61.menu.clock.crystal_14746k.build.clocksource=1
attinyx61.menu.clock.crystal_11059k=11.059 MHz (crystal)
attinyx61.menu.clock.crystal_11059k.bootloader.low_fuses=0xFF
attinyx61.menu.clock.crystal_11059k.build.f_cpu=11059000UL
attinyx61.menu.clock.crystal_11059k.build.speed=11059k
attinyx61.menu.clock.crystal_11059k.build.clocksource=1
attinyx61.menu.clock.crystal_9216k=9.216 MHz (crystal)
attinyx61.menu.clock.crystal_9216k.bootloader.low_fuses=0xFF
attinyx61.menu.clock.crystal_9216k.build.f_cpu=9216000UL
attinyx61.menu.clock.crystal_9216k.build.speed=9216k
attinyx61.menu.clock.crystal_9216k.build.clocksource=1
attinyx61.menu.clock.crystal_7372k=7.372 MHz (crystal)
attinyx61.menu.clock.crystal_7372k.bootloader.low_fuses=0xFD
attinyx61.menu.clock.crystal_7372k.build.f_cpu=7372000UL
attinyx61.menu.clock.crystal_7372k.build.speed=7372k
attinyx61.menu.clock.crystal_7372k.build.clocksource=1
attinyx61.menu.clock.internal_12m=12 MHz (internal, tuned)
attinyx61.menu.clock.internal_12m.bootloader.low_fuses=0xE2
attinyx61.menu.clock.internal_12m.build.f_cpu=12000000L
attinyx61.menu.clock.internal_12m.build.speed=12m
attinyx61.menu.clock.internal_12m.build.clocksource=0
attinyx61.menu.clock.internal_8m_tuned=8 MHz (internal, tuned)
attinyx61.menu.clock.internal_8m_tuned.bootloader.low_fuses=0xE2
attinyx61.menu.clock.internal_8m_tuned.build.f_cpu=8000000L
attinyx61.menu.clock.internal_8m_tuned.build.speed=8m
attinyx61.menu.clock.internal_8m_tuned.build.clocksource=0
attinyx61.menu.clock.internal_128k=128 kHz (internal WDT)
attinyx61.menu.clock.internal_128k.build.f_cpu=128000L
attinyx61.menu.clock.internal_128k.build.speed=128k
attinyx61.menu.clock.internal_128k.build.clocksource=3
attinyx61.menu.clock.internal_128k.bootloader.low_fuses=0xC3
attinyx61.menu.clock.extclk_16m=16 MHz (external clock)
attinyx61.menu.clock.extclk_16m.bootloader.low_fuses=0xE0
attinyx61.menu.clock.extclk_16m.build.f_cpu=16000000UL
attinyx61.menu.clock.extclk_16m.build.speed=16
attinyx61.menu.clock.extclk_16m.build.clocksource=2
attinyx61.menu.clock.extclk_8m=8 MHz (external clock)
attinyx61.menu.clock.extclk_8m.bootloader.low_fuses=0xE0
attinyx61.menu.clock.extclk_8m.build.f_cpu=8000000UL
attinyx61.menu.clock.extclk_8m.build.speed=8
attinyx61.menu.clock.extclk_8m.build.clocksource=2
attinyx61.menu.clock.extclk_20m=20 MHz (external clock)
attinyx61.menu.clock.extclk_20m.bootloader.low_fuses=0xE0
attinyx61.menu.clock.extclk_20m.build.f_cpu=20000000UL
attinyx61.menu.clock.extclk_20m.build.speed=20
attinyx61.menu.clock.extclk_20m.build.clocksource=2
attinyx61.menu.clock.extclk_12m=12 MHz (external clock)
attinyx61.menu.clock.extclk_12m.bootloader.low_fuses=0xE0
attinyx61.menu.clock.extclk_12m.build.f_cpu=12000000UL
attinyx61.menu.clock.extclk_12m.build.speed=12
attinyx61.menu.clock.extclk_12m.build.clocksource=2
attinyx61.menu.clock.extclk_6m=6 MHz (external clock)
attinyx61.menu.clock.extclk_6m.bootloader.low_fuses=0xE0
attinyx61.menu.clock.extclk_6m.build.f_cpu=6000000UL
attinyx61.menu.clock.extclk_6m.build.speed=6
attinyx61.menu.clock.extclk_6m.build.clocksource=2
attinyx61.menu.clock.extclk_18432k=18.432 MHz (external clock)
attinyx61.menu.clock.extclk_18432k.bootloader.low_fuses=0xE0
attinyx61.menu.clock.extclk_18432k.build.f_cpu=18432000UL
attinyx61.menu.clock.extclk_18432k.build.speed=18432k
attinyx61.menu.clock.extclk_18432k.build.clocksource=2
attinyx61.menu.clock.extclk_14746k=14.746 MHz (external clock)
attinyx61.menu.clock.extclk_14746k.bootloader.low_fuses=0xE0
attinyx61.menu.clock.extclk_14746k.build.f_cpu=14746000UL
attinyx61.menu.clock.extclk_14746k.build.speed=14746k
attinyx61.menu.clock.extclk_14746k.build.clocksource=2
attinyx61.menu.clock.extclk_11059k=11.059 MHz (external clock)
attinyx61.menu.clock.extclk_11059k.bootloader.low_fuses=0xE0
attinyx61.menu.clock.extclk_11059k.build.f_cpu=11059000UL
attinyx61.menu.clock.extclk_11059k.build.speed=11059k
attinyx61.menu.clock.extclk_11059k.build.clocksource=2
attinyx61.menu.clock.extclk_9216k=9.216 MHz (external clock)
attinyx61.menu.clock.extclk_9216k.bootloader.low_fuses=0xE0
attinyx61.menu.clock.extclk_9216k.build.f_cpu=9216000UL
attinyx61.menu.clock.extclk_9216k.build.speed=9216k
attinyx61.menu.clock.extclk_9216k.build.clocksource=2
attinyx61.menu.clock.extclk_7372k=7.372 MHz (external clock)
attinyx61.menu.clock.extclk_7372k.bootloader.low_fuses=0xE0
attinyx61.menu.clock.extclk_7372k.build.f_cpu=7372000UL
attinyx61.menu.clock.extclk_7372k.build.speed=7372k
attinyx61.menu.clock.extclk_7372k.build.clocksource=2

#########################
# Pin Mapping menu      #
#########################
attinyx61.menu.pinmap.default=Standard
attinyx61.menu.pinmap.legacy=Legacy
attinyx61.menu.pinmap.legacy.build.variant=tinyx61_legacy
attinyx61.menu.pinmap.default.build.pinmapabr=
attinyx61.menu.pinmap.legacy.build.pinmapabr=.old

#########################
# Retain EEPROM menu    #
#########################
attinyx61.menu.eesave.aenable=EEPROM retained
attinyx61.menu.eesave.aenable.bootloader.eesave_bit=0
attinyx61.menu.eesave.disable=EEPROM not retained
attinyx61.menu.eesave.disable.bootloader.eesave_bit=1

#########################
# Software Serial menu  #
#########################
attinyx61.menu.softserial.enable_AIN1=RX on PA7, TX on PA (default PA6)
attinyx61.menu.softserial.enable_AIN0=RX on PA6, TX on PA (default PA7)
attinyx61.menu.softserial.enable_AIN0.build.softser=-DSOFTSERIAL_RXAIN0
attinyx61.menu.softserial.enable_AIN0.build.softserabr=ssAIN0
attinyx61.menu.softserial.enable_AIN2=RX on PA5, TX on PA (default PA6)
attinyx61.menu.softserial.enable_AIN2.build.softser=-DSOFTSERIAL_RXAIN2
attinyx61.menu.softserial.enable_AIN2.build.softserabr=ssAIN2
attinyx61.menu.softserial.txonly=No receiving, transmit only.
attinyx61.menu.softserial.txonly.build.softserabr=ssTX
attinyx61.menu.softserial.txonly.build.softser=-DSOFT_TX_ONLY

#########################
# BrownOut Detect menu  #
#########################
attinyx61.menu.bod.disable=B.O.D. Disabled (saves power)
attinyx61.menu.bod.disable.bootloader.bod_bits=111
attinyx61.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx61.menu.bod.1v8.bootloader.bod_bits=110
attinyx61.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx61.menu.bod.2v7.bootloader.bod_bits=101
attinyx61.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx61.menu.bod.4v3.bootloader.bod_bits=100

#########################
# millis/micros menu    #
#########################
attinyx61.menu.millis.enabled=Enabled
attinyx61.menu.millis.enabled.build.millis=
attinyx61.menu.millis.enabled.build.millisabr=
attinyx61.menu.millis.disabled=Disabled (saves flash)
attinyx61.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx61.menu.millis.disabled.build.millisabr=mNONE

