SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                       ###   ##   ###
#  #   #   #    #  #                #   # #  # #   #
#  #####   #   ###    ###  #  #      ###    #   ###
#  #   #   #    #  #  #  # #  #     #   #  #   #   #
#  #   #   #    #  #  #  #  ###      ###  ####  ###
#_____________________________#_________________________________________________
                           ###

attiny828.build.board=AVR_ATTINY828
attiny828.build.core=tiny
attiny828.build.variant=tiny828
attiny828.build.export_merged_output=false
attiny828.bootloader.extended_fuses=0b{bootloader.bodpd_bits}{bootloader.bodact_bits}1111
attiny828.bootloader.high_fuses=0b{bootloader.rstbit}101{bootloader.eesave_bit}{bootloader.bod_bits}
attiny828.bootloader.rstbit=1
attiny828.build.usbpinset=
attiny828.build.tuneorcal=
attiny828.build.softserabr=
attiny828.build.softser=
attiny828.build.pinmapabr=
attiny828.upload.tool=avrdude
attiny828.bootloader.tool=avrdude
attiny828.build.bootloader=
attiny828.build.bootloaderabr=
attiny828.bootloader.flashstring=

#########################
# Optimization menu     #
#########################
attiny828.menu.optimization.size=-Os (size, recommended)
attiny828.menu.optimization.othree=-O3 (speed)
attiny828.menu.optimization.debug=-Og (for advanced debugging)
attiny828.menu.optimization.size.build.optimize=-Os
attiny828.menu.optimization.othree.build.optimize=-O3
attiny828.menu.optimization.debug.build.optimize=-Og
attiny828.build.mcu=attiny828

#########################
# Clocking menu options #
#########################
attiny828.menu.clock.internal_8m_4v5=8 MHz (internal > 4.5V)
attiny828.menu.clock.internal_8m_4v5.bootloader.low_fuses=0xE2
attiny828.menu.clock.internal_8m_4v5.build.f_cpu=8000000L
attiny828.menu.clock.internal_8m_4v5.build.speed=8m
attiny828.menu.clock.internal_8m_4v5.build.clocksource=0
attiny828.menu.clock.internal_8m_4v5.build.tuneorcal=-DCAL_NUDGE_DOWN
attiny828.menu.clock.internal_8m=8 MHz (internal)
attiny828.menu.clock.internal_8m.bootloader.low_fuses=0xE2
attiny828.menu.clock.internal_8m.build.f_cpu=8000000L
attiny828.menu.clock.internal_8m.build.speed=8m
attiny828.menu.clock.internal_8m.build.clocksource=0
attiny828.menu.clock.internal_1m=1 MHz (internal)
attiny828.menu.clock.internal_1m.bootloader.low_fuses=0x62
attiny828.menu.clock.internal_1m.build.f_cpu=1000000L
attiny828.menu.clock.internal_1m.build.speed=1m
attiny828.menu.clock.internal_1m.build.clocksource=0x10
attiny828.menu.clock.internal_4m=4 MHz (internal)
attiny828.menu.clock.internal_4m.bootloader.low_fuses=0x62
attiny828.menu.clock.internal_4m.build.f_cpu=4000000L
attiny828.menu.clock.internal_4m.build.speed=4m
attiny828.menu.clock.internal_4m.build.clocksource=0x10
attiny828.menu.clock.internal.4m.bootloader.f_cpu=1000000L
attiny828.menu.clock.internal_2m=2 MHz (internal)
attiny828.menu.clock.internal_2m.bootloader.low_fuses=0x62
attiny828.menu.clock.internal_2m.build.f_cpu=2000000L
attiny828.menu.clock.internal_2m.build.speed=2m
attiny828.menu.clock.internal_2m.build.clocksource=0x10
attiny828.menu.clock.internal.2m.bootloader.f_cpu=1000000L
attiny828.menu.clock.internal_12m=12 MHz (internal, tuned)
attiny828.menu.clock.internal_12m.bootloader.low_fuses=0xE2
attiny828.menu.clock.internal_12m.build.f_cpu=12000000L
attiny828.menu.clock.internal_12m.build.speed=12m
attiny828.menu.clock.internal_12m.build.clocksource=0
attiny828.menu.clock.internal_8m_tuned=8 MHz (internal, tuned)
attiny828.menu.clock.internal_8m_tuned_low.bootloader.low_fuses=0xE2
attiny828.menu.clock.internal_8m_tuned_low.build.f_cpu=8000000L
attiny828.menu.clock.internal_8m_tuned_low.build.speed=8m
attiny828.menu.clock.internal_8m_tuned_low.build.clocksource=0
attiny828.menu.clock.internal_8m_tuned_high=8 MHz (internal, tuned)
attiny828.menu.clock.internal_8m_tuned_high.bootloader.low_fuses=0xE2
attiny828.menu.clock.internal_8m_tuned_high.build.f_cpu=8000000L
attiny828.menu.clock.internal_8m_tuned_high.build.speed=8m
attiny828.menu.clock.internal_8m_tuned_high.build.clocksource=0
attiny828.menu.clock.extclk_16m=16 MHz (external clock)
attiny828.menu.clock.extclk_16m.bootloader.low_fuses=0xEC
attiny828.menu.clock.extclk_16m.build.f_cpu=16000000UL
attiny828.menu.clock.extclk_16m.build.speed=16
attiny828.menu.clock.extclk_16m.build.clocksource=2
attiny828.menu.clock.extclk_8m=8 MHz (external clock)
attiny828.menu.clock.extclk_8m.bootloader.low_fuses=0xEC
attiny828.menu.clock.extclk_8m.build.f_cpu=8000000UL
attiny828.menu.clock.extclk_8m.build.speed=8
attiny828.menu.clock.extclk_8m.build.clocksource=2
attiny828.menu.clock.extclk_20m=20 MHz (external clock)
attiny828.menu.clock.extclk_20m.bootloader.low_fuses=0xEC
attiny828.menu.clock.extclk_20m.build.f_cpu=20000000UL
attiny828.menu.clock.extclk_20m.build.speed=20
attiny828.menu.clock.extclk_20m.build.clocksource=2
attiny828.menu.clock.extclk_12m=12 MHz (external clock)
attiny828.menu.clock.extclk_12m.bootloader.low_fuses=0xEC
attiny828.menu.clock.extclk_12m.build.f_cpu=12000000UL
attiny828.menu.clock.extclk_12m.build.speed=12
attiny828.menu.clock.extclk_12m.build.clocksource=2
attiny828.menu.clock.extclk_6m=6 MHz (external clock)
attiny828.menu.clock.extclk_6m.bootloader.low_fuses=0xEC
attiny828.menu.clock.extclk_6m.build.f_cpu=6000000UL
attiny828.menu.clock.extclk_6m.build.speed=6
attiny828.menu.clock.extclk_6m.build.clocksource=2
attiny828.menu.clock.extclk_18432k=18.432 MHz (external clock)
attiny828.menu.clock.extclk_18432k.bootloader.low_fuses=0xEC
attiny828.menu.clock.extclk_18432k.build.f_cpu=18432000UL
attiny828.menu.clock.extclk_18432k.build.speed=18432k
attiny828.menu.clock.extclk_18432k.build.clocksource=2
attiny828.menu.clock.extclk_14746k=14.746 MHz (external clock)
attiny828.menu.clock.extclk_14746k.bootloader.low_fuses=0xEC
attiny828.menu.clock.extclk_14746k.build.f_cpu=14746000UL
attiny828.menu.clock.extclk_14746k.build.speed=14746k
attiny828.menu.clock.extclk_14746k.build.clocksource=2
attiny828.menu.clock.extclk_11059k=11.059 MHz (external clock)
attiny828.menu.clock.extclk_11059k.bootloader.low_fuses=0xEC
attiny828.menu.clock.extclk_11059k.build.f_cpu=11059000UL
attiny828.menu.clock.extclk_11059k.build.speed=11059k
attiny828.menu.clock.extclk_11059k.build.clocksource=2
attiny828.menu.clock.extclk_9216k=9.216 MHz (external clock)
attiny828.menu.clock.extclk_9216k.bootloader.low_fuses=0xEC
attiny828.menu.clock.extclk_9216k.build.f_cpu=9216000UL
attiny828.menu.clock.extclk_9216k.build.speed=9216k
attiny828.menu.clock.extclk_9216k.build.clocksource=2
attiny828.menu.clock.extclk_7372k=7.372 MHz (external clock)
attiny828.menu.clock.extclk_7372k.bootloader.low_fuses=0xEC
attiny828.menu.clock.extclk_7372k.build.f_cpu=7372000UL
attiny828.menu.clock.extclk_7372k.build.speed=7372k
attiny828.menu.clock.extclk_7372k.build.clocksource=2

#########################
# Retain EEPROM menu    #
#########################
attiny828.menu.eesave.aenable=EEPROM retained
attiny828.menu.eesave.aenable.bootloader.eesave_bit=0
attiny828.menu.eesave.disable=EEPROM not retained
attiny828.menu.eesave.disable.bootloader.eesave_bit=1

#########################
# Wire Modes menu       #
#########################
attiny828.menu.wiremode.master=Master Only
attiny828.menu.wiremode.master.build.wiremode=-DWIRE_MASTER_ONLY
attiny828.menu.wiremode.slave=Slave Only
attiny828.menu.wiremode.slave.build.wiremode=-DWIRE_SLAVE_ONLY
attiny828.menu.wiremode.slave.build.wiremodeabr=wS
attiny828.menu.wiremode.both=Either (uses more flash)
attiny828.menu.wiremode.both.build.wiremode=-DWIRE_BOTH
attiny828.menu.wiremode.slave.build.wiremodeabr=wB

#########################
# BrownOut Detect menu  #
#########################
attiny828.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny828.menu.bod.1v8.bootloader.bod_bits=110
attiny828.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny828.menu.bod.2v7.bootloader.bod_bits=101
attiny828.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny828.menu.bod.4v3.bootloader.bod_bits=100
attiny828.menu.bodact.disabled=B.O.D. Disabled (saves power)
attiny828.menu.bodact.disabled.bootloader.bodact_bits=11
attiny828.menu.bodact.enabled=B.O.D. Enabled
attiny828.menu.bodact.enabled.bootloader.bodact_bits=10
attiny828.menu.bodact.sampled=B.O.D. Sampled Mode
attiny828.menu.bodact.sampled.bootloader.bodact_bits=01
attiny828.menu.bodpd.disabled=B.O.D. Disabled (saves power)
attiny828.menu.bodpd.disabled.bootloader.bodpd_bits=11
attiny828.menu.bodpd.enabled=B.O.D. Enabled
attiny828.menu.bodpd.enabled.bootloader.bodpd_bits=10
attiny828.menu.bodpd.sampled=B.O.D. Sampled Mode
attiny828.menu.bodpd.sampled.bootloader.bodpd_bits=01

#########################
# millis/micros menu    #
#########################
attiny828.menu.millis.enabled=Enabled
attiny828.menu.millis.enabled.build.millis=
attiny828.menu.millis.enabled.build.millisabr=
attiny828.menu.millis.disabled=Disabled (saves flash)
attiny828.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attiny828.menu.millis.disabled.build.millisabr=mNONE

