SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                      #  # ###
#  #   #   #    #  #                #  #    #
#  #####   #   ###    ###  #  #     ####  ##
#  #   #   #    #  #  #  # #  #        #    #
#  #   #   #    #  #  #  #  ###        # ###
#_____________________________#_________________________________________________
                           ###

attiny43u.build.board=AVR_ATTINY43U
attiny43u.build.core=tiny
attiny43u.build.variant=tiny43
attiny43u.build.export_merged_output=false
attiny43u.bootloader.extended_fuses=0xFE
attiny43u.bootloader.high_fuses=0b{bootloader.rstbit}101{bootloader.eesave_bit}{bootloader.bod_bits}
attiny43u.bootloader.rstbit=1
attiny43u.build.usbpinset=
attiny43u.build.tuneorcal=
attiny43u.build.softserabr=
attiny43u.build.softser=
attiny43u.build.wiremodeabr=
attiny43u.build.wiremode=
attiny43u.build.pinmapabr=
attiny43u.upload.tool=avrdude
attiny43u.bootloader.tool=avrdude
attiny43u.build.bootloader=
attiny43u.build.bootloaderabr=
attiny43u.bootloader.flashstring=

#########################
# Optimization menu     #
#########################
attiny43u.menu.optimization.size=-Os (size, recommended)
attiny43u.menu.optimization.othree=-O3 (speed)
attiny43u.menu.optimization.debug=-Og (for advanced debugging)
attiny43u.menu.optimization.size.build.optimize=-Os
attiny43u.menu.optimization.othree.build.optimize=-O3
attiny43u.menu.optimization.debug.build.optimize=-Og
attiny43u.build.mcu=attiny43u

#########################
# Clocking menu options #
#########################
attiny43u.menu.clock.internal_8m=8 MHz (internal)
attiny43u.menu.clock.internal_8m.bootloader.low_fuses=0xE2
attiny43u.menu.clock.internal_8m.build.f_cpu=8000000L
attiny43u.menu.clock.internal_8m.build.speed=8m
attiny43u.menu.clock.internal_8m.build.clocksource=0
attiny43u.menu.clock.internal_1m=1 MHz (internal)
attiny43u.menu.clock.internal_1m.bootloader.low_fuses=0x62
attiny43u.menu.clock.internal_1m.build.f_cpu=1000000L
attiny43u.menu.clock.internal_1m.build.speed=1m
attiny43u.menu.clock.internal_1m.build.clocksource=0x10
attiny43u.menu.clock.internal_4m=4 MHz (internal)
attiny43u.menu.clock.internal_4m.bootloader.low_fuses=0x62
attiny43u.menu.clock.internal_4m.build.f_cpu=4000000L
attiny43u.menu.clock.internal_4m.build.speed=4m
attiny43u.menu.clock.internal_4m.build.clocksource=0x10
attiny43u.menu.clock.internal.4m.bootloader.f_cpu=1000000L
attiny43u.menu.clock.internal_2m=2 MHz (internal)
attiny43u.menu.clock.internal_2m.bootloader.low_fuses=0x62
attiny43u.menu.clock.internal_2m.build.f_cpu=2000000L
attiny43u.menu.clock.internal_2m.build.speed=2m
attiny43u.menu.clock.internal_2m.build.clocksource=0x10
attiny43u.menu.clock.internal.2m.bootloader.f_cpu=1000000L
attiny43u.menu.clock.crystal_16m=16 MHz (crystal)
attiny43u.menu.clock.crystal_16m.bootloader.low_fuses=0xFF
attiny43u.menu.clock.crystal_16m.build.f_cpu=16000000UL
attiny43u.menu.clock.crystal_16m.build.speed=16
attiny43u.menu.clock.crystal_16m.build.clocksource=1
attiny43u.menu.clock.crystal_8m=8 MHz (crystal)
attiny43u.menu.clock.crystal_8m.bootloader.low_fuses=0xFF
attiny43u.menu.clock.crystal_8m.build.f_cpu=8000000UL
attiny43u.menu.clock.crystal_8m.build.speed=8
attiny43u.menu.clock.crystal_8m.build.clocksource=1
attiny43u.menu.clock.crystal_20m=20 MHz (crystal)
attiny43u.menu.clock.crystal_20m.bootloader.low_fuses=0xFF
attiny43u.menu.clock.crystal_20m.build.f_cpu=20000000UL
attiny43u.menu.clock.crystal_20m.build.speed=20
attiny43u.menu.clock.crystal_20m.build.clocksource=1
attiny43u.menu.clock.crystal_12m=12 MHz (crystal)
attiny43u.menu.clock.crystal_12m.bootloader.low_fuses=0xFF
attiny43u.menu.clock.crystal_12m.build.f_cpu=12000000UL
attiny43u.menu.clock.crystal_12m.build.speed=12
attiny43u.menu.clock.crystal_12m.build.clocksource=1
attiny43u.menu.clock.crystal_6m=6 MHz (crystal)
attiny43u.menu.clock.crystal_6m.bootloader.low_fuses=0xFD
attiny43u.menu.clock.crystal_6m.build.f_cpu=6000000UL
attiny43u.menu.clock.crystal_6m.build.speed=6
attiny43u.menu.clock.crystal_6m.build.clocksource=1
attiny43u.menu.clock.crystal_18432k=18.432 MHz (crystal)
attiny43u.menu.clock.crystal_18432k.bootloader.low_fuses=0xFF
attiny43u.menu.clock.crystal_18432k.build.f_cpu=18432000UL
attiny43u.menu.clock.crystal_18432k.build.speed=18432k
attiny43u.menu.clock.crystal_18432k.build.clocksource=1
attiny43u.menu.clock.crystal_14746k=14.746 MHz (crystal)
attiny43u.menu.clock.crystal_14746k.bootloader.low_fuses=0xFF
attiny43u.menu.clock.crystal_14746k.build.f_cpu=14746000UL
attiny43u.menu.clock.crystal_14746k.build.speed=14746k
attiny43u.menu.clock.crystal_14746k.build.clocksource=1
attiny43u.menu.clock.crystal_11059k=11.059 MHz (crystal)
attiny43u.menu.clock.crystal_11059k.bootloader.low_fuses=0xFF
attiny43u.menu.clock.crystal_11059k.build.f_cpu=11059000UL
attiny43u.menu.clock.crystal_11059k.build.speed=11059k
attiny43u.menu.clock.crystal_11059k.build.clocksource=1
attiny43u.menu.clock.crystal_9216k=9.216 MHz (crystal)
attiny43u.menu.clock.crystal_9216k.bootloader.low_fuses=0xFF
attiny43u.menu.clock.crystal_9216k.build.f_cpu=9216000UL
attiny43u.menu.clock.crystal_9216k.build.speed=9216k
attiny43u.menu.clock.crystal_9216k.build.clocksource=1
attiny43u.menu.clock.crystal_7372k=7.372 MHz (crystal)
attiny43u.menu.clock.crystal_7372k.bootloader.low_fuses=0xFD
attiny43u.menu.clock.crystal_7372k.build.f_cpu=7372000UL
attiny43u.menu.clock.crystal_7372k.build.speed=7372k
attiny43u.menu.clock.crystal_7372k.build.clocksource=1
attiny43u.menu.clock.internal_12m=12 MHz (internal, tuned)
attiny43u.menu.clock.internal_12m.bootloader.low_fuses=0xE2
attiny43u.menu.clock.internal_12m.build.f_cpu=12000000L
attiny43u.menu.clock.internal_12m.build.speed=12m
attiny43u.menu.clock.internal_12m.build.clocksource=0
attiny43u.menu.clock.internal_8m_tuned=8 MHz (internal, tuned)
attiny43u.menu.clock.internal_8m_tuned.bootloader.low_fuses=0xE2
attiny43u.menu.clock.internal_8m_tuned.build.f_cpu=8000000L
attiny43u.menu.clock.internal_8m_tuned.build.speed=8m
attiny43u.menu.clock.internal_8m_tuned.build.clocksource=0
attiny43u.menu.clock.internal_128k=128 kHz (internal WDT)
attiny43u.menu.clock.internal_128k.build.f_cpu=128000L
attiny43u.menu.clock.internal_128k.build.speed=128k
attiny43u.menu.clock.internal_128k.build.clocksource=3
attiny43u.menu.clock.internal_128k.bootloader.low_fuses=0xC3
attiny43u.menu.clock.extclk_16m=16 MHz (external clock)
attiny43u.menu.clock.extclk_16m.bootloader.low_fuses=0xE0
attiny43u.menu.clock.extclk_16m.build.f_cpu=16000000UL
attiny43u.menu.clock.extclk_16m.build.speed=16
attiny43u.menu.clock.extclk_16m.build.clocksource=2
attiny43u.menu.clock.extclk_8m=8 MHz (external clock)
attiny43u.menu.clock.extclk_8m.bootloader.low_fuses=0xE0
attiny43u.menu.clock.extclk_8m.build.f_cpu=8000000UL
attiny43u.menu.clock.extclk_8m.build.speed=8
attiny43u.menu.clock.extclk_8m.build.clocksource=2
attiny43u.menu.clock.extclk_20m=20 MHz (external clock)
attiny43u.menu.clock.extclk_20m.bootloader.low_fuses=0xE0
attiny43u.menu.clock.extclk_20m.build.f_cpu=20000000UL
attiny43u.menu.clock.extclk_20m.build.speed=20
attiny43u.menu.clock.extclk_20m.build.clocksource=2
attiny43u.menu.clock.extclk_12m=12 MHz (external clock)
attiny43u.menu.clock.extclk_12m.bootloader.low_fuses=0xE0
attiny43u.menu.clock.extclk_12m.build.f_cpu=12000000UL
attiny43u.menu.clock.extclk_12m.build.speed=12
attiny43u.menu.clock.extclk_12m.build.clocksource=2
attiny43u.menu.clock.extclk_6m=6 MHz (external clock)
attiny43u.menu.clock.extclk_6m.bootloader.low_fuses=0xE0
attiny43u.menu.clock.extclk_6m.build.f_cpu=6000000UL
attiny43u.menu.clock.extclk_6m.build.speed=6
attiny43u.menu.clock.extclk_6m.build.clocksource=2
attiny43u.menu.clock.extclk_18432k=18.432 MHz (external clock)
attiny43u.menu.clock.extclk_18432k.bootloader.low_fuses=0xE0
attiny43u.menu.clock.extclk_18432k.build.f_cpu=18432000UL
attiny43u.menu.clock.extclk_18432k.build.speed=18432k
attiny43u.menu.clock.extclk_18432k.build.clocksource=2
attiny43u.menu.clock.extclk_14746k=14.746 MHz (external clock)
attiny43u.menu.clock.extclk_14746k.bootloader.low_fuses=0xE0
attiny43u.menu.clock.extclk_14746k.build.f_cpu=14746000UL
attiny43u.menu.clock.extclk_14746k.build.speed=14746k
attiny43u.menu.clock.extclk_14746k.build.clocksource=2
attiny43u.menu.clock.extclk_11059k=11.059 MHz (external clock)
attiny43u.menu.clock.extclk_11059k.bootloader.low_fuses=0xE0
attiny43u.menu.clock.extclk_11059k.build.f_cpu=11059000UL
attiny43u.menu.clock.extclk_11059k.build.speed=11059k
attiny43u.menu.clock.extclk_11059k.build.clocksource=2
attiny43u.menu.clock.extclk_9216k=9.216 MHz (external clock)
attiny43u.menu.clock.extclk_9216k.bootloader.low_fuses=0xE0
attiny43u.menu.clock.extclk_9216k.build.f_cpu=9216000UL
attiny43u.menu.clock.extclk_9216k.build.speed=9216k
attiny43u.menu.clock.extclk_9216k.build.clocksource=2
attiny43u.menu.clock.extclk_7372k=7.372 MHz (external clock)
attiny43u.menu.clock.extclk_7372k.bootloader.low_fuses=0xE0
attiny43u.menu.clock.extclk_7372k.build.f_cpu=7372000UL
attiny43u.menu.clock.extclk_7372k.build.speed=7372k
attiny43u.menu.clock.extclk_7372k.build.clocksource=2

#########################
# Retain EEPROM menu    #
#########################
attiny43u.menu.eesave.aenable=EEPROM retained
attiny43u.menu.eesave.aenable.bootloader.eesave_bit=0
attiny43u.menu.eesave.disable=EEPROM not retained
attiny43u.menu.eesave.disable.bootloader.eesave_bit=1

#########################
# Software Serial menu  #
#########################
attiny43u.menu.softserial.enable=RX on PA5, TX on PA (default PA4)
attiny43u.menu.softserial.txonly=No receiving, transmit only.
attiny43u.menu.softserial.txonly.build.softser=-DSOFT_TX_ONLY
attiny43u.menu.softserial.txonly.build.softserabr=ssTX

#########################
# BrownOut Detect menu  #
#########################
attiny43u.menu.bod.disable=B.O.D. Disabled (saves power)
attiny43u.menu.bod.disable.bootloader.bod_bits=111
attiny43u.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny43u.menu.bod.1v8.bootloader.bod_bits=110
attiny43u.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny43u.menu.bod.2v7.bootloader.bod_bits=101
attiny43u.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny43u.menu.bod.4v3.bootloader.bod_bits=100

#########################
# millis/micros menu    #
#########################
attiny43u.menu.millis.enabled=Enabled
attiny43u.menu.millis.enabled.build.millis=
attiny43u.menu.millis.enabled.build.millisabr=
attiny43u.menu.millis.disabled=Disabled (saves flash)
attiny43u.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attiny43u.menu.millis.disabled.build.millisabr=mNONE


################################################################################
#     ##                                                                ##     #
#     ##            ####    ###    ###   ####   ####    ###             ##     #
#     ##            #   #  #   #  #   #  #   #  #   #  #                ##     #
#     ##            ####   #   #  #####  ####   #   #   ###             ##     #
#     ##            #   #  #   #  #   #  #  #   #   #      #            ##     #
#     ##            ####    ###   #   #  #   #  ####    ###             ##     #
#_____##________________________________________________________________##_____#
#                     With the Optiboot Serial bootloader                      #
#     Available for all parts with 4k+ flash which come in a version that      #
#     has at least 8k of flash and which support self-programming.             #
#    43, 44, 84, 441, 841, 45, 85, 461, 861, 87, 167, 48, 88, 828, and 1634    #
#______________________________________________________________________________#

