SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                      #  #  ##       ###
#  #   #   #    #  #                #  # ###      #   #       #  #
#  #####   #   ###    ###  #  # # # ####  ##      #   # ###  ###
#  #   #   #    #  #  #  # #  #  #     #  ##      #   # #  #  #  #
#  #   #   #    #  #  #  #  ### # #    # ####      ###  ###   #  #
#_____________________________#_________________________#_______________________
                           ###                          #

attinyx41opti.build.board=AVR_ATTINYX41
attinyx41opti.build.core=tiny
attinyx41opti.build.variant=tinyx41_cw
attinyx41opti.build.export_merged_output=false
attinyx41opti.bootloader.extended_fuses=0b111{bootloader.bodpd_bits}{bootloader.bodact_bits}0
attinyx41opti.bootloader.high_fuses=0b{bootloader.rstbit}1011{bootloader.bod_bits}
attinyx41opti.bootloader.rstbit=1
attinyx41opti.build.usbpinset=
attinyx41opti.build.tuneorcal=
attinyx41opti.build.softserabr=
attinyx41opti.build.softser=
attinyx41opti.upload.tool=avrdude
attinyx41opti.bootloader.tool=avrdude
attinyx41opti.bootloader.flashstring=-Uflash:w:{bootloader.file}:i
attinyx41opti.build.bootloader=-DUSING_BOOTLOADER=0x01
attinyx41opti.build.bootloaderabr=opti
attinyx41opti.bootloader.speed={build.f_cpu}
attinyx41opti.upload.protocol=arduino
attinyx41opti.bootloader.uart=

#########################
# Optimization menu     #
#########################
attinyx41opti.menu.optimization.size=-Os (size, recommended)
attinyx41opti.menu.optimization.othree=-O3 (speed)
attinyx41opti.menu.optimization.debug=-Og (for advanced debugging)
attinyx41opti.menu.optimization.size.build.optimize=-Os
attinyx41opti.menu.optimization.othree.build.optimize=-O3
attinyx41opti.menu.optimization.debug.build.optimize=-Og

#########################
# Microcontroller menu  #
#########################
attinyx41opti.menu.chip.841=ATtiny841
attinyx41opti.menu.chip.841.build.mcu=attiny841
attinyx41opti.menu.chip.841.upload.maximum_size=7552
attinyx41opti.menu.chip.841.upload.maximum_data_size=512
attinyx41opti.menu.chip.441=ATtiny441
attinyx41opti.menu.chip.441.build.mcu=attiny441
attinyx41opti.menu.chip.441.upload.maximum_size=3456
attinyx41opti.menu.chip.441.upload.maximum_data_size=256

#########################
# Clocking menu options #
#########################
attinyx41opti.menu.clock.internal_8m_4v5=8 MHz (internal > 4.5V)
attinyx41opti.menu.clock.internal_8m_4v5.bootloader.low_fuses=0xE2
attinyx41opti.menu.clock.internal_8m_4v5.build.f_cpu=8000000L
attinyx41opti.menu.clock.internal_8m_4v5.build.speed=8m
attinyx41opti.menu.clock.internal_8m_4v5.build.clocksource=0
attinyx41opti.menu.clock.internal_8m_4v5.build.tuneorcal=-DCAL_NUDGE_DOWN
attinyx41opti.menu.clock.internal_8m_4v5.upload.speed=76800
attinyx41opti.menu.clock.internal_8m=8 MHz (internal)
attinyx41opti.menu.clock.internal_8m.bootloader.low_fuses=0xE2
attinyx41opti.menu.clock.internal_8m.build.f_cpu=8000000L
attinyx41opti.menu.clock.internal_8m.build.speed=8m
attinyx41opti.menu.clock.internal_8m.build.clocksource=0
attinyx41opti.menu.clock.internal_8m.upload.speed=76800
attinyx41opti.menu.clock.internal_1m=1 MHz (internal)
attinyx41opti.menu.clock.internal_1m.bootloader.low_fuses=0x62
attinyx41opti.menu.clock.internal_1m.build.f_cpu=1000000L
attinyx41opti.menu.clock.internal_1m.build.speed=1m
attinyx41opti.menu.clock.internal_1m.build.clocksource=0x10
attinyx41opti.menu.clock.internal_1m.upload.speed=9600
attinyx41opti.menu.clock.internal_4m=4 MHz (internal)
attinyx41opti.menu.clock.internal_4m.bootloader.low_fuses=0x62
attinyx41opti.menu.clock.internal_4m.build.f_cpu=4000000L
attinyx41opti.menu.clock.internal_4m.build.speed=4m
attinyx41opti.menu.clock.internal_4m.build.clocksource=0x10
attinyx41opti.menu.clock.internal.4m.bootloader.f_cpu=1000000L
attinyx41opti.menu.clock.internal_4m.upload.speed=9600
attinyx41opti.menu.clock.internal_2m=2 MHz (internal)
attinyx41opti.menu.clock.internal_2m.bootloader.low_fuses=0x62
attinyx41opti.menu.clock.internal_2m.build.f_cpu=2000000L
attinyx41opti.menu.clock.internal_2m.build.speed=2m
attinyx41opti.menu.clock.internal_2m.build.clocksource=0x10
attinyx41opti.menu.clock.internal.2m.bootloader.f_cpu=1000000L
attinyx41opti.menu.clock.internal_2m.upload.speed=9600
attinyx41opti.menu.clock.internal_16m=16 MHz (internal via tuning/guess)
attinyx41opti.menu.clock.internal_16m.bootloader.low_fuses=0xE2
attinyx41opti.menu.clock.internal_16m.build.f_cpu=16000000L
attinyx41opti.menu.clock.internal_16m.build.speed=16m
attinyx41opti.menu.clock.internal_16m.build.clocksource=0
attinyx41opti.menu.clock.internal_8m.upload.speed=76800
attinyx41opti.menu.clock.crystal_16m=16 MHz (crystal)
attinyx41opti.menu.clock.crystal_16m.bootloader.low_fuses=0xEE
attinyx41opti.menu.clock.crystal_16m.build.f_cpu=16000000UL
attinyx41opti.menu.clock.crystal_16m.build.speed=16
attinyx41opti.menu.clock.crystal_16m.build.clocksource=1
attinyx41opti.menu.clock.crystal_8m=8 MHz (crystal)
attinyx41opti.menu.clock.crystal_8m.bootloader.low_fuses=0xEE
attinyx41opti.menu.clock.crystal_8m.build.f_cpu=8000000UL
attinyx41opti.menu.clock.crystal_8m.build.speed=8
attinyx41opti.menu.clock.crystal_8m.build.clocksource=1
attinyx41opti.menu.clock.crystal_20m=20 MHz (crystal)
attinyx41opti.menu.clock.crystal_20m.bootloader.low_fuses=0xEE
attinyx41opti.menu.clock.crystal_20m.build.f_cpu=20000000UL
attinyx41opti.menu.clock.crystal_20m.build.speed=20
attinyx41opti.menu.clock.crystal_20m.build.clocksource=1
attinyx41opti.menu.clock.crystal_12m=12 MHz (crystal)
attinyx41opti.menu.clock.crystal_12m.bootloader.low_fuses=0xEE
attinyx41opti.menu.clock.crystal_12m.build.f_cpu=12000000UL
attinyx41opti.menu.clock.crystal_12m.build.speed=12
attinyx41opti.menu.clock.crystal_12m.build.clocksource=1
attinyx41opti.menu.clock.crystal_6m=6 MHz (crystal)
attinyx41opti.menu.clock.crystal_6m.bootloader.low_fuses=0xED
attinyx41opti.menu.clock.crystal_6m.build.f_cpu=6000000UL
attinyx41opti.menu.clock.crystal_6m.build.speed=6
attinyx41opti.menu.clock.crystal_6m.build.clocksource=1
attinyx41opti.menu.clock.crystal_18432k=18.432 MHz (crystal)
attinyx41opti.menu.clock.crystal_18432k.bootloader.low_fuses=0xEE
attinyx41opti.menu.clock.crystal_18432k.build.f_cpu=18432000UL
attinyx41opti.menu.clock.crystal_18432k.build.speed=18432k
attinyx41opti.menu.clock.crystal_18432k.build.clocksource=1
attinyx41opti.menu.clock.crystal_14746k=14.746 MHz (crystal)
attinyx41opti.menu.clock.crystal_14746k.bootloader.low_fuses=0xEE
attinyx41opti.menu.clock.crystal_14746k.build.f_cpu=14746000UL
attinyx41opti.menu.clock.crystal_14746k.build.speed=14746k
attinyx41opti.menu.clock.crystal_14746k.build.clocksource=1
attinyx41opti.menu.clock.crystal_11059k=11.059 MHz (crystal)
attinyx41opti.menu.clock.crystal_11059k.bootloader.low_fuses=0xEE
attinyx41opti.menu.clock.crystal_11059k.build.f_cpu=11059000UL
attinyx41opti.menu.clock.crystal_11059k.build.speed=11059k
attinyx41opti.menu.clock.crystal_11059k.build.clocksource=1
attinyx41opti.menu.clock.crystal_9216k=9.216 MHz (crystal)
attinyx41opti.menu.clock.crystal_9216k.bootloader.low_fuses=0xEE
attinyx41opti.menu.clock.crystal_9216k.build.f_cpu=9216000UL
attinyx41opti.menu.clock.crystal_9216k.build.speed=9216k
attinyx41opti.menu.clock.crystal_9216k.build.clocksource=1
attinyx41opti.menu.clock.crystal_7372k=7.372 MHz (crystal)
attinyx41opti.menu.clock.crystal_7372k.bootloader.low_fuses=0xED
attinyx41opti.menu.clock.crystal_7372k.build.f_cpu=7372000UL
attinyx41opti.menu.clock.crystal_7372k.build.speed=7372k
attinyx41opti.menu.clock.crystal_7372k.build.clocksource=1
attinyx41opti.menu.clock.internal_12m=12 MHz (internal, tuned)
attinyx41opti.menu.clock.internal_12m.bootloader.low_fuses=0xE2
attinyx41opti.menu.clock.internal_12m.build.f_cpu=12000000L
attinyx41opti.menu.clock.internal_12m.build.speed=12m
attinyx41opti.menu.clock.internal_12m.build.clocksource=0
attinyx41opti.menu.clock.internal_12m.upload.speed=115200
attinyx41opti.menu.clock.internal_8m_tuned=8 MHz (internal, tuned)
attinyx41opti.menu.clock.internal_8m_tuned_low.bootloader.low_fuses=0xE2
attinyx41opti.menu.clock.internal_8m_tuned_low.build.f_cpu=8000000L
attinyx41opti.menu.clock.internal_8m_tuned_low.build.speed=8m
attinyx41opti.menu.clock.internal_8m_tuned_low.build.clocksource=0
attinyx41opti.menu.clock.internal_8m_tuned_low.upload.speed=76800
attinyx41opti.menu.clock.internal_8m_tuned_high=8 MHz (internal, tuned)
attinyx41opti.menu.clock.internal_8m_tuned_high.bootloader.low_fuses=0xE2
attinyx41opti.menu.clock.internal_8m_tuned_high.build.f_cpu=8000000L
attinyx41opti.menu.clock.internal_8m_tuned_high.build.speed=8m
attinyx41opti.menu.clock.internal_8m_tuned_high.build.clocksource=0
attinyx41opti.menu.clock.internal_8m_tuned_high.upload.speed=76800
attinyx41opti.menu.clock.extclk_16m=16 MHz (external clock)
attinyx41opti.menu.clock.extclk_16m.bootloader.low_fuses=0xE0
attinyx41opti.menu.clock.extclk_16m.build.f_cpu=16000000UL
attinyx41opti.menu.clock.extclk_16m.build.speed=16
attinyx41opti.menu.clock.extclk_16m.build.clocksource=2
attinyx41opti.menu.clock.extclk_16m.upload.speed=76800
attinyx41opti.menu.clock.extclk_8m=8 MHz (external clock)
attinyx41opti.menu.clock.extclk_8m.bootloader.low_fuses=0xE0
attinyx41opti.menu.clock.extclk_8m.build.f_cpu=8000000UL
attinyx41opti.menu.clock.extclk_8m.build.speed=8
attinyx41opti.menu.clock.extclk_8m.build.clocksource=2
attinyx41opti.menu.clock.extclk_8m.upload.speed=76800
attinyx41opti.menu.clock.extclk_20m=20 MHz (external clock)
attinyx41opti.menu.clock.extclk_20m.bootloader.low_fuses=0xE0
attinyx41opti.menu.clock.extclk_20m.build.f_cpu=20000000UL
attinyx41opti.menu.clock.extclk_20m.build.speed=20
attinyx41opti.menu.clock.extclk_20m.build.clocksource=2
attinyx41opti.menu.clock.extclk_20m.upload.speed=115200
attinyx41opti.menu.clock.extclk_12m=12 MHz (external clock)
attinyx41opti.menu.clock.extclk_12m.bootloader.low_fuses=0xE0
attinyx41opti.menu.clock.extclk_12m.build.f_cpu=12000000UL
attinyx41opti.menu.clock.extclk_12m.build.speed=12
attinyx41opti.menu.clock.extclk_12m.build.clocksource=2
attinyx41opti.menu.clock.extclk_12m.upload.speed=115200
attinyx41opti.menu.clock.extclk_6m=6 MHz (external clock)
attinyx41opti.menu.clock.extclk_6m.bootloader.low_fuses=0xE0
attinyx41opti.menu.clock.extclk_6m.build.f_cpu=6000000UL
attinyx41opti.menu.clock.extclk_6m.build.speed=6
attinyx41opti.menu.clock.extclk_6m.build.clocksource=2
attinyx41opti.menu.clock.extclk_6m.upload.speed=57600
attinyx41opti.menu.clock.extclk_18432k=18.432 MHz (external clock)
attinyx41opti.menu.clock.extclk_18432k.bootloader.low_fuses=0xE0
attinyx41opti.menu.clock.extclk_18432k.build.f_cpu=18432000UL
attinyx41opti.menu.clock.extclk_18432k.build.speed=18432k
attinyx41opti.menu.clock.extclk_18432k.build.clocksource=2
attinyx41opti.menu.clock.extclk_18432k.upload.speed=115200
attinyx41opti.menu.clock.extclk_14746k=14.746 MHz (external clock)
attinyx41opti.menu.clock.extclk_14746k.bootloader.low_fuses=0xE0
attinyx41opti.menu.clock.extclk_14746k.build.f_cpu=14746000UL
attinyx41opti.menu.clock.extclk_14746k.build.speed=14746k
attinyx41opti.menu.clock.extclk_14746k.build.clocksource=2
attinyx41opti.menu.clock.extclk_14746k.upload.speed=115200
attinyx41opti.menu.clock.extclk_11059k=11.059 MHz (external clock)
attinyx41opti.menu.clock.extclk_11059k.bootloader.low_fuses=0xE0
attinyx41opti.menu.clock.extclk_11059k.build.f_cpu=11059000UL
attinyx41opti.menu.clock.extclk_11059k.build.speed=11059k
attinyx41opti.menu.clock.extclk_11059k.build.clocksource=2
attinyx41opti.menu.clock.extclk_11059k.upload.speed=115200
attinyx41opti.menu.clock.extclk_9216k=9.216 MHz (external clock)
attinyx41opti.menu.clock.extclk_9216k.bootloader.low_fuses=0xE0
attinyx41opti.menu.clock.extclk_9216k.build.f_cpu=9216000UL
attinyx41opti.menu.clock.extclk_9216k.build.speed=9216k
attinyx41opti.menu.clock.extclk_9216k.build.clocksource=2
attinyx41opti.menu.clock.extclk_9216k.upload.speed=115200
attinyx41opti.menu.clock.extclk_7372k=7.372 MHz (external clock)
attinyx41opti.menu.clock.extclk_7372k.bootloader.low_fuses=0xE0
attinyx41opti.menu.clock.extclk_7372k.build.f_cpu=7372000UL
attinyx41opti.menu.clock.extclk_7372k.build.speed=7372k
attinyx41opti.menu.clock.extclk_7372k.build.clocksource=2
attinyx41opti.menu.clock.extclk_7372k.upload.speed=76800

#########################
# Pin Mapping menu      #
#########################
attinyx41opti.menu.pinmap.default=Standard (clockwise)
attinyx41opti.menu.pinmap.ccw=Legacy (counterclockwise)
attinyx41opti.menu.pinmap.ccw.build.variant=tinyx41_legacy
attinyx41opti.menu.pinmap.default.build.pinmapabr=.cw
attinyx41opti.menu.pinmap.ccw.build.pinmapabr=.ccw

#########################
# Wire Modes menu       #
#########################
attinyx41opti.menu.wiremode.master=Master Only
attinyx41opti.menu.wiremode.master.build.wiremode=-DWIRE_MASTER_ONLY
attinyx41opti.menu.wiremode.slave=Slave Only
attinyx41opti.menu.wiremode.slave.build.wiremode=-DWIRE_SLAVE_ONLY
attinyx41opti.menu.wiremode.slave.build.wiremodeabr=wS
attinyx41opti.menu.wiremode.both=Either (uses more flash)
attinyx41opti.menu.wiremode.both.build.wiremode=-DWIRE_BOTH
attinyx41opti.menu.wiremode.slave.build.wiremodeabr=wB

#########################
# BrownOut Detect menu  #
#########################
attinyx41opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx41opti.menu.bod.1v8.bootloader.bod_bits=110
attinyx41opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx41opti.menu.bod.2v7.bootloader.bod_bits=101
attinyx41opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx41opti.menu.bod.4v3.bootloader.bod_bits=100
attinyx41opti.menu.bodact.disabled=B.O.D. Disabled (saves power)
attinyx41opti.menu.bodact.disabled.bootloader.bodact_bits=11
attinyx41opti.menu.bodact.enabled=B.O.D. Enabled
attinyx41opti.menu.bodact.enabled.bootloader.bodact_bits=10
attinyx41opti.menu.bodact.sampled=B.O.D. Sampled Mode
attinyx41opti.menu.bodact.sampled.bootloader.bodact_bits=01
attinyx41opti.menu.bodpd.disabled=B.O.D. Disabled (saves power)
attinyx41opti.menu.bodpd.disabled.bootloader.bodpd_bits=11
attinyx41opti.menu.bodpd.enabled=B.O.D. Enabled
attinyx41opti.menu.bodpd.enabled.bootloader.bodpd_bits=10
attinyx41opti.menu.bodpd.sampled=B.O.D. Sampled Mode
attinyx41opti.menu.bodpd.sampled.bootloader.bodpd_bits=01

#########################
# millis/micros menu    #
#########################
attinyx41opti.menu.millis.enabled=Enabled
attinyx41opti.menu.millis.enabled.build.millis=
attinyx41opti.menu.millis.enabled.build.millisabr=
attinyx41opti.menu.millis.disabled=Disabled (saves flash)
attinyx41opti.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx41opti.menu.millis.disabled.build.millisabr=mNONE

#########################
# Boot Entrymode menu   #
#########################
attinyx41opti.menu.bootentry.1s=Standard (1s wait, for use w/autoreset)
attinyx41opti.menu.bootentry.1s.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}{bootloader.uart}.hex
attinyx41opti.menu.bootentry.8s=8-second (8s wait, for use w. out/autoreset)
attinyx41opti.menu.bootentry.8s_8sec.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}{bootloader.uart}_8sec.hex

################################
# Serial Port:                 #
################################
attinyx41opti.menu.bootloaderuart.uart0=Serial 0 (TX: PB0, RX: PA7, LED: PC0)
attinyx41opti.menu.bootloaderuart.uart1=Serial 1 (TX: PB0, RX: PA7, LED: PC0)
attinyx41opti.menu.bootloaderuart.uart0.bootloader.uart=
attinyx41opti.menu.bootloaderuart.uart1.bootloader.uart=_ser1

