SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                      #  #         #   #  ###  ####
#  #   #   #    #  #                #  #         #   # #     #   #
#  #####   #   ###    ###  #  # # # ####     # # #   #  ###  ####
#  #   #   #    #  #  #  # #  #  #     #     # # #   #     # #   #
#  #   #   #    #  #  #  #  ### # #    #      #   ###  ####  ####
#_____________________________#_______________________________________________________
                           ###

attiny84mi12.build.board=AVR_ATTINY84
attiny84mi12.build.core=tiny
attiny84mi12.build.variant=tinyx4_cw
attiny84mi12.build.export_merged_output=false
attiny84mi12.bootloader.extended_fuses=0xFE
attiny84mi12.bootloader.high_fuses=0b{bootloader.rstbit}1011{bootloader.bod_bits}
attiny84mi12.bootloader.rstbit=1
attiny84mi12.build.usbpinset=
attiny84mi12.build.tuneorcal=
attiny84mi12.build.softserabr=
attiny84mi12.build.softser=
attiny84mi12.build.wiremodeabr=
attiny84mi12.build.wiremode=
attiny84mi12.build.bootloader=-DUSING_BOOTLOADER=0x08
attiny84mi12.build.bootloaderabr=micr
attiny84mi12.upload.tool=micronucleus
attiny84mi12.bootloader.devpostfix=

#########################
# Optimization menu     #
#########################
attiny84mi12.menu.optimization.size=-Os (size, recommended)
attiny84mi12.menu.optimization.othree=-O3 (speed)
attiny84mi12.menu.optimization.debug=-Og (for advanced debugging)
attiny84mi12.menu.optimization.size.build.optimize=-Os
attiny84mi12.menu.optimization.othree.build.optimize=-O3
attiny84mi12.menu.optimization.debug.build.optimize=-Og
attiny84mi12.build.mcu=attiny84

#########################
# Clocking menu options #
#########################
attiny84mi12.menu.clock.internal_8m=8 MHz
attiny84mi12.menu.clock.internal_8m.bootloader.low_fuses=0xE2
attiny84mi12.menu.clock.internal_8m.build.f_cpu=8000000L
attiny84mi12.menu.clock.internal_8m.build.speed=8m
attiny84mi12.menu.clock.internal_8m.build.clocksource=0
attiny84mi12.menu.clock.internal_8m.build.extra_flags=-DBOOT_TUNED120
attiny84mi12.menu.clock.internal_12m=12 MHz (tuned by bootloader)
attiny84mi12.menu.clock.internal_12m.bootloader.low_fuses=0xE2
attiny84mi12.menu.clock.internal_12m.build.f_cpu=12000000L
attiny84mi12.menu.clock.internal_12m.build.speed=12m
attiny84mi12.menu.clock.internal_12m.build.clocksource=0
attiny84mi12.menu.clock.internal_12m.build.extra_flags=-DBOOT_TUNED120

#########################
# Pin Mapping menu      #
#########################
attiny84mi12.menu.pinmap.default=Standard (clockwise)
attiny84mi12.menu.pinmap.ccw=Legacy (counterclockwise)
attiny84mi12.menu.pinmap.ccw.build.variant=tinyx4_legacy
attiny84mi12.menu.pinmap.default.build.pinmapabr=.cw
attiny84mi12.menu.pinmap.ccw.build.pinmapabr=.ccw

#########################
# Software Serial menu  #
#########################
attiny84mi12.menu.softserial.enable=RX on PA2, TX on PA (default PA1)
attiny84mi12.menu.softserial.txonly=No receiving, transmit only.
attiny84mi12.menu.softserial.txonly.build.softser=-DSOFT_TX_ONLY
attiny84mi12.menu.softserial.txonly.build.softserabr=ssTX

#########################
# BrownOut Detect menu  #
#########################
attiny84mi12.menu.bod.disable=B.O.D. Disabled (saves power)
attiny84mi12.menu.bod.disable.bootloader.bod_bits=111
attiny84mi12.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny84mi12.menu.bod.1v8.bootloader.bod_bits=110
attiny84mi12.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny84mi12.menu.bod.2v7.bootloader.bod_bits=101
attiny84mi12.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny84mi12.menu.bod.4v3.bootloader.bod_bits=100

#########################
# millis/micros menu    #
#########################
attiny84mi12.menu.millis.enabled=Enabled
attiny84mi12.menu.millis.enabled.build.millis=
attiny84mi12.menu.millis.enabled.build.millisabr=
attiny84mi12.menu.millis.disabled=Disabled (saves flash)
attiny84mi12.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attiny84mi12.menu.millis.disabled.build.millisabr=mNONE

#########################
# Boot Entrymode menu   #
#########################
attiny84mi12.menu.bootentry.extrf_porf=External Reset and Power On Reset
attiny84mi12.menu.bootentry.extrf_porf.bootloader.entrymode=extrf_porf
attiny84mi12.menu.bootentry.extrf_safe=External Reset, or if reset pin disabled and HIGH
attiny84mi12.menu.bootentry.extrf_safe.bootloader.entrymode=extrf_safe
attiny84mi12.menu.bootentry.extrfonly_safe=External Reset only, or if reset pin disabled and HIGH
attiny84mi12.menu.bootentry.extrfonly_safe.bootloader.entrymode=extrfonly_safe
attiny84mi12.menu.bootentry.wdrf=Watchdog Reset only
attiny84mi12.menu.bootentry.wdrf.bootloader.entrymode=wdrf
attiny84mi12.menu.bootentry.porf=Power On Reset only
attiny84mi12.menu.bootentry.porf.bootloader.entrymode=porf
attiny84mi12.menu.bootentry.anyreset=Any reset (but not jump from app)
attiny84mi12.menu.bootentry.anyreset.bootloader.entrymode=anyreset
attiny84mi12.menu.bootentry.always=Always (permits jump from app)
attiny84mi12.menu.bootentry.always.bootloader.entrymode=always
attiny84mi12.menu.bootentry.jumper=Jumper (see documentation) (permits jump from app)
attiny84mi12.menu.bootentry.jumper.bootloader.entrymode=jumper
attiny84mi12.menu.bootentry.jumper.upload.maximum_size=6524

################################
# Pins used for USB            #
################################
attiny84mi12.menu.usbpins.pb2plus=PB0: LED, PB1: D-, PB2: D+
attiny84mi12.menu.usbpins.pb1plus=PB0: D-, PB1: D+, PB2: LED
attiny84mi12.menu.usbpins.pb0plus=PB0: D+, PB1: D-, PB2: LED
attiny84mi12.menu.usbpins.pb2plus.build.usbpinset=-DUSB_TWOPLUS -DLED_BUILTIN=PIN_PB0
attiny84mi12.menu.usbpins.pb1plus.build.usbpinset=-DUSB_ONEPLUS
attiny84mi12.menu.usbpins.pb0plus.build.usbpinset=-DUSB_ZEROPLUS
attiny84mi12.menu.usbpins.pb2plus.bootloader.usbpinsetname=_pb2plus
attiny84mi12.menu.usbpins.pb1plus.bootloader.usbpinsetname=_pb1plus
attiny84mi12.menu.usbpins.pb0plus.bootloader.usbpinsetname=_pb0plus
attiny84mi12.menu.resetpin.reset=Reset pin. Further ISP programming possible
attiny84mi12.menu.resetpin.reset.bootloader.rstbit=1
attiny84mi12.menu.resetpin.gpio=I/O pin - DANGER: If anything goes wrong, only HV programming can unbrick!
attiny84mi12.menu.resetpin.gpio.bootloader.rstbit=0

################################
# Upgrade vs ISP install menu  #
################################
attiny84mi12.menu.burnmode.upgrade=Upgrade (via USB)
attiny84mi12.menu.burnmode.upgrade.bootloader.file=micronucleus/hex/upgrade-attiny84mi12{bootloader.devpostfix}{bootloader.usbpinsetname}_{bootloader.entrymode}.hex
attiny84mi12.menu.burnmode.upgrade.bootloader.tool=micronucleus
attiny84mi12.menu.burnmode.install=Fresh Install (via ISP)
attiny84mi12.menu.burnmode.install.bootloader.file=micronucleus/hex/attiny84mi12{bootloader.devpostfix}{bootloader.usbpinsetname}_{bootloader.entrymode}.hex
attiny84mi12.menu.burnmode.install.bootloader.tool=avrdude
attiny84mi12.menu.burnmode.install.bootloader.flashstring=-Uflash:w:{bootloader.file}:i

