SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                       ###          #   #  ###  ####
#  #   #   #    #  #                #   #         #   # #     #   #
#  #####   #   ###    ###  #  # # #  ###      # # #   #  ###  ####
#  #   #   #    #  #  #  # #  #  #  #   #     # # #   #     # #   #
#  #   #   #    #  #  #  #  ### # #  ###       #   ###  ####  ####
#_____________________________#_______________________________________________________
                           ###

attiny88micr.build.board=AVR_ATTINY88
attiny88micr.build.core=tiny
attiny88micr.build.variant=tinyx8_MH
attiny88micr.build.export_merged_output=false
attiny88micr.bootloader.extended_fuses=0xFE
attiny88micr.bootloader.high_fuses=0b{bootloader.rstbit}1011{bootloader.bod_bits}
attiny88micr.bootloader.rstbit=1
attiny88micr.build.usbpinset=
attiny88micr.build.tuneorcal=
attiny88micr.build.softserabr=
attiny88micr.build.softser=
attiny88micr.build.wiremodeabr=
attiny88micr.build.wiremode=
attiny88micr.build.bootloader=-DUSING_BOOTLOADER=0x08
attiny88micr.build.bootloaderabr=micr
attiny88micr.upload.tool=micronucleus
attiny88micr.bootloader.devpostfix=

#########################
# Optimization menu     #
#########################
attiny88micr.menu.optimization.size=-Os (size, recommended)
attiny88micr.menu.optimization.othree=-O3 (speed)
attiny88micr.menu.optimization.debug=-Og (for advanced debugging)
attiny88micr.menu.optimization.size.build.optimize=-Os
attiny88micr.menu.optimization.othree.build.optimize=-O3
attiny88micr.menu.optimization.debug.build.optimize=-Og
attiny88micr.build.mcu=attiny88

#########################
# Clocking menu options #
#########################
attiny88micr.menu.clock.extclk_16m=16 MHz (external clock)
attiny88micr.menu.clock.extclk_16m.bootloader.low_fuses=0xE0
attiny88micr.menu.clock.extclk_16m.build.f_cpu=16000000UL
attiny88micr.menu.clock.extclk_16m.build.speed=16
attiny88micr.menu.clock.extclk_16m.build.clocksource=2
attiny88micr.menu.clock.extclk_8m=8 MHz (prescaled 16 MHz external clock)
attiny88micr.menu.clock.extclk_8m.bootloader.low_fuses=0xE0
attiny88micr.menu.clock.extclk_8m.build.f_cpu=8000000UL
attiny88micr.menu.clock.extclk_8m.build.speed=8
attiny88micr.menu.clock.extclk_8m.build.clocksource=0x12
attiny88micr.menu.clock.extclk_4m=4 MHz (prescaled 16 MHz external clock)
attiny88micr.menu.clock.extclk_4m.bootloader.low_fuses=0xE0
attiny88micr.menu.clock.extclk_4m.build.f_cpu=4000000UL
attiny88micr.menu.clock.extclk_4m.build.speed=4
attiny88micr.menu.clock.extclk_4m.build.clocksource=0x12
attiny88micr.menu.clock.extclk_2m=2 MHz (prescaled 16 MHz external clock)
attiny88micr.menu.clock.extclk_2m.bootloader.low_fuses=0xE0
attiny88micr.menu.clock.extclk_2m.build.f_cpu=2000000UL
attiny88micr.menu.clock.extclk_2m.build.speed=2
attiny88micr.menu.clock.extclk_2m.build.clocksource=0x12
attiny88micr.menu.clock.extclk_1m=1 MHz (prescaled 16 MHz external clock)
attiny88micr.menu.clock.extclk_1m.bootloader.low_fuses=0xE0
attiny88micr.menu.clock.extclk_1m.build.f_cpu=1000000UL
attiny88micr.menu.clock.extclk_1m.build.speed=1
attiny88micr.menu.clock.extclk_1m.build.clocksource=0x12

#########################
# Pin Mapping menu      #
#########################
attiny88micr.menu.pinmap.mhet=MH-Tiny
attiny88micr.menu.pinmap.default=Standard
attiny88micr.menu.pinmap.mhet.build.variant=tinyx8_MH
attiny88micr.menu.pinmap.default.build.pinmapabr=
attiny88micr.menu.pinmap.mhet.build.pinmapabr=.mhet

#########################
# Software Serial menu  #
#########################
attiny88micr.menu.softserial.enable=RX on PD7, TX on PD (default PD6)
attiny88micr.menu.softserial.txonly=No receiving, transmit only.
attiny88micr.menu.softserial.txonly.build.softser=-DSOFT_TX_ONLY
attiny88micr.menu.softserial.txonly.build.softserabr=ssTX

#########################
# BrownOut Detect menu  #
#########################
attiny88micr.menu.bod.disable=B.O.D. Disabled (saves power)
attiny88micr.menu.bod.disable.bootloader.bod_bits=111
attiny88micr.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny88micr.menu.bod.1v8.bootloader.bod_bits=110
attiny88micr.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny88micr.menu.bod.2v7.bootloader.bod_bits=101
attiny88micr.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny88micr.menu.bod.4v3.bootloader.bod_bits=100

#########################
# millis/micros menu    #
#########################
attiny88micr.menu.millis.enabled=Enabled
attiny88micr.menu.millis.enabled.build.millis=
attiny88micr.menu.millis.enabled.build.millisabr=
attiny88micr.menu.millis.disabled=Disabled (saves flash)
attiny88micr.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attiny88micr.menu.millis.disabled.build.millisabr=mNONE

#########################
# Boot Entrymode menu   #
#########################
attiny88micr.menu.bootentry.extrf_porf=External Reset and Power On Reset
attiny88micr.menu.bootentry.extrf_porf.bootloader.entrymode=extrf_porf
attiny88micr.menu.bootentry.extrf_safe=External Reset, or if reset pin disabled and HIGH
attiny88micr.menu.bootentry.extrf_safe.bootloader.entrymode=extrf_safe
attiny88micr.menu.bootentry.extrfonly_safe=External Reset only, or if reset pin disabled and HIGH
attiny88micr.menu.bootentry.extrfonly_safe.bootloader.entrymode=extrfonly_safe
attiny88micr.menu.bootentry.wdrf=Watchdog Reset only
attiny88micr.menu.bootentry.wdrf.bootloader.entrymode=wdrf
attiny88micr.menu.bootentry.porf=Power On Reset only
attiny88micr.menu.bootentry.porf.bootloader.entrymode=porf
attiny88micr.menu.bootentry.anyreset=Any reset (but not jump from app)
attiny88micr.menu.bootentry.anyreset.bootloader.entrymode=anyreset
attiny88micr.menu.bootentry.always=Always (permits jump from app)
attiny88micr.menu.bootentry.always.bootloader.entrymode=always
attiny88micr.menu.bootentry.jumper=Jumper (see documentation) (permits jump from app)
attiny88micr.menu.bootentry.jumper.bootloader.entrymode=jumper
attiny88micr.menu.bootentry.jumper.upload.maximum_size=6718

################################
# Pins used for USB            #
################################
attiny88micr.menu.usbpins.standard=MH Tiny - PD1: D-, PD2: D+, PD0: LED
attiny88micr.menu.usbpins.standard.bootloader.usbpinset=
attiny88micr.menu.usbpins.standard.bootloader.usbpinsetname=
attiny88micr.menu.resetpin.reset=Reset pin. Further ISP programming possible
attiny88micr.menu.resetpin.reset.bootloader.rstbit=1
attiny88micr.menu.resetpin.gpio=I/O pin - DANGER: If anything goes wrong, only HV programming can unbrick!
attiny88micr.menu.resetpin.gpio.bootloader.rstbit=0

################################
# Upgrade vs ISP install menu  #
################################
attiny88micr.menu.burnmode.upgrade=Upgrade (via USB)
attiny88micr.menu.burnmode.upgrade.bootloader.file=micronucleus/hex/upgrade-attiny88micr{bootloader.devpostfix}{bootloader.usbpinsetname}_{bootloader.entrymode}.hex
attiny88micr.menu.burnmode.upgrade.bootloader.tool=micronucleus
attiny88micr.menu.burnmode.install=Fresh Install (via ISP)
attiny88micr.menu.burnmode.install.bootloader.file=micronucleus/hex/attiny88micr{bootloader.devpostfix}{bootloader.usbpinsetname}_{bootloader.entrymode}.hex
attiny88micr.menu.burnmode.install.bootloader.tool=avrdude
attiny88micr.menu.burnmode.install.bootloader.flashstring=-Uflash:w:{bootloader.file}:i

